print("โปรแกรมคำนวณพื้นที่และเส้นรอบรูปสี่เหลี่ยมมุมฉาก")

while True:
    กว้าง = float(input("กรอกความกว้าง: "))
    ยาว = float(input("กรอกความยาว: "))

    พื้นที่ = กว้าง * ยาว
    เส้นรอบรูป = 2 * (กว้าง + ยาว)

    print("\nผลลัพธ์")
    print("ความกว้าง =", กว้าง)
    print("ความยาว =", ยาว)
    print("พื้นที่ =", พื้นที่)
    print("เส้นรอบรูป =", เส้นรอบรูป)

    ทำต่อ = input("\nต้องการคำนวณอีกหรือไม่ (y/n): ")
    if ทำต่อ.lower() != "y":
        print("จบการทำงาน")
        breakprint("โปรแกรมคำนวณพื้นที่และเส้นรอบรูปสี่เหลี่ยมมุมฉาก")

while True:
    กว้าง = float(input("กรอกความกว้าง: "))
    ยาว = float(input("กรอกความยาว: "))

    พื้นที่ = กว้าง * ยาว
    เส้นรอบรูป = 2 * (กว้าง + ยาว)

    print("\nผลลัพธ์")
    print("ความกว้าง =", กว้าง)
    print("ความยาว =", ยาว)
    print("พื้นที่ =", พื้นที่)
    print("เส้นรอบรูป =", เส้นรอบรูป)

    ทำต่อ = input("\nต้องการคำนวณอีกหรือไม่ (y/n): ")
    if ทำต่อ.lower() != "y":
        print("จบการทำงาน")
        break